MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/pmc.h
/* -------- PMC_WPMR : (PMC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define PMC_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (PMC_WPMR) Write Protection Enable Position */
#define PMC_WPMR_WPEN_Msk                     (_UINT32_(0x1) << PMC_WPMR_WPEN_Pos)                 /* (PMC_WPMR) Write Protection Enable Mask */
#define PMC_WPMR_WPEN(value)                  (PMC_WPMR_WPEN_Msk & (_UINT32_(value) << PMC_WPMR_WPEN_Pos)) /* Assignment of value for WPEN in the PMC_WPMR register */
#define PMC_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (PMC_WPMR) Write Protection Key Position */
#define PMC_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << PMC_WPMR_WPKEY_Pos)           /* (PMC_WPMR) Write Protection Key Mask */
#define PMC_WPMR_WPKEY(value)                 (PMC_WPMR_WPKEY_Msk & (_UINT32_(value) << PMC_WPMR_WPKEY_Pos)) /* Assignment of value for WPKEY in the PMC_WPMR register */
#define   PMC_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x504D43)                                   /* (PMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define PMC_WPMR_WPKEY_PASSWD                 (PMC_WPMR_WPKEY_PASSWD_Val << PMC_WPMR_WPKEY_Pos)    /* (PMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position */
#define PMC_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (PMC_WPMR) Register Mask  */


/* -------- PMC_WPSR : (PMC Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define PMC_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (PMC_WPSR) Write Protection Violation Status Position */
#define PMC_WPSR_WPVS_Msk                     (_UINT32_(0x1) << PMC_WPSR_WPVS_Pos)                 /* (PMC_WPSR) Write Protection Violation Status Mask */
#define PMC_WPSR_WPVS(value)                  (PMC_WPSR_WPVS_Msk & (_UINT32_(value) << PMC_WPSR_WPVS_Pos)) /* Assignment of value for WPVS in the PMC_WPSR register */
#define PMC_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (PMC_WPSR) Write Protection Violation Source Position */
#define PMC_WPSR_WPVSRC_Msk                   (_UINT32_(0xFFFF) << PMC_WPSR_WPVSRC_Pos)            /* (PMC_WPSR) Write Protection Violation Source Mask */
#define PMC_WPSR_WPVSRC(value)                (PMC_WPSR_WPVSRC_Msk & (_UINT32_(value) << PMC_WPSR_WPVSRC_Pos)) /* Assignment of value for WPVSRC in the PMC_WPSR register */
#define PMC_WPSR_Msk                          _UINT32_(0x00FFFF01)                                 /* (PMC_WPSR) Register Mask  */


/* -------- PMC_PCER1 : (PMC Offset: 0x100) ( /W 32) Peripheral Clock Enable Register 1 -------- */
#define PMC_PCER1_PID32_Pos                   _UINT32_(0)                                          /* (PMC_PCER1) Peripheral Clock 32 Enable Position */
#define PMC_PCER1_PID32_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID32_Pos)               /* (PMC_PCER1) Peripheral Clock 32 Enable Mask */
#define PMC_PCER1_PID32(value)                (PMC_PCER1_PID32_Msk & (_UINT32_(value) << PMC_PCER1_PID32_Pos)) /* Assignment of value for PID32 in the PMC_PCER1 register */
#define PMC_PCER1_PID33_Pos                   _UINT32_(1)                                          /* (PMC_PCER1) Peripheral Clock 33 Enable Position */
#define PMC_PCER1_PID33_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID33_Pos)               /* (PMC_PCER1) Peripheral Clock 33 Enable Mask */
#define PMC_PCER1_PID33(value)                (PMC_PCER1_PID33_Msk & (_UINT32_(value) << PMC_PCER1_PID33_Pos)) /* Assignment of value for PID33 in the PMC_PCER1 register */
#define PMC_PCER1_PID34_Pos                   _UINT32_(2)                                          /* (PMC_PCER1) Peripheral Clock 34 Enable Position */
#define PMC_PCER1_PID34_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID34_Pos)               /* (PMC_PCER1) Peripheral Clock 34 Enable Mask */
#define PMC_PCER1_PID34(value)                (PMC_PCER1_PID34_Msk & (_UINT32_(value) << PMC_PCER1_PID34_Pos)) /* Assignment of value for PID34 in the PMC_PCER1 register */
#define PMC_PCER1_PID35_Pos                   _UINT32_(3)                                          /* (PMC_PCER1) Peripheral Clock 35 Enable Position */
#define PMC_PCER1_PID35_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID35_Pos)               /* (PMC_PCER1) Peripheral Clock 35 Enable Mask */
#define PMC_PCER1_PID35(value)                (PMC_PCER1_PID35_Msk & (_UINT32_(value) << PMC_PCER1_PID35_Pos)) /* Assignment of value for PID35 in the PMC_PCER1 register */
#define PMC_PCER1_PID37_Pos                   _UINT32_(5)                                          /* (PMC_PCER1) Peripheral Clock 37 Enable Position */
#define PMC_PCER1_PID37_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID37_Pos)               /* (PMC_PCER1) Peripheral Clock 37 Enable Mask */
#define PMC_PCER1_PID37(value)                (PMC_PCER1_PID37_Msk & (_UINT32_(value) << PMC_PCER1_PID37_Pos)) /* Assignment of value for PID37 in the PMC_PCER1 register */
#define PMC_PCER1_PID39_Pos                   _UINT32_(7)                                          /* (PMC_PCER1) Peripheral Clock 39 Enable Position */
#define PMC_PCER1_PID39_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID39_Pos)               /* (PMC_PCER1) Peripheral Clock 39 Enable Mask */
#define PMC_PCER1_PID39(value)                (PMC_PCER1_PID39_Msk & (_UINT32_(value) << PMC_PCER1_PID39_Pos)) /* Assignment of value for PID39 in the PMC_PCER1 register */
#define PMC_PCER1_PID40_Pos                   _UINT32_(8)                                          /* (PMC_PCER1) Peripheral Clock 40 Enable Position */
#define PMC_PCER1_PID40_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID40_Pos)               /* (PMC_PCER1) Peripheral Clock 40 Enable Mask */
#define PMC_PCER1_PID40(value)                (PMC_PCER1_PID40_Msk & (_UINT32_(value) << PMC_PCER1_PID40_Pos)) /* Assignment of value for PID40 in the PMC_PCER1 register */
#define PMC_PCER1_PID41_Pos                   _UINT32_(9)                                          /* (PMC_PCER1) Peripheral Clock 41 Enable Position */
#define PMC_PCER1_PID41_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID41_Pos)               /* (PMC_PCER1) Peripheral Clock 41 Enable Mask */
#define PMC_PCER1_PID41(value)                (PMC_PCER1_PID41_Msk & (_UINT32_(value) << PMC_PCER1_PID41_Pos)) /* Assignment of value for PID41 in the PMC_PCER1 register */
#define PMC_PCER1_PID42_Pos                   _UINT32_(10)                                         /* (PMC_PCER1) Peripheral Clock 42 Enable Position */
#define PMC_PCER1_PID42_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID42_Pos)               /* (PMC_PCER1) Peripheral Clock 42 Enable Mask */
#define PMC_PCER1_PID42(value)                (PMC_PCER1_PID42_Msk & (_UINT32_(value) << PMC_PCER1_PID42_Pos)) /* Assignment of value for PID42 in the PMC_PCER1 register */
#define PMC_PCER1_PID43_Pos                   _UINT32_(11)                                         /* (PMC_PCER1) Peripheral Clock 43 Enable Position */
#define PMC_PCER1_PID43_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID43_Pos)               /* (PMC_PCER1) Peripheral Clock 43 Enable Mask */
#define PMC_PCER1_PID43(value)                (PMC_PCER1_PID43_Msk & (_UINT32_(value) << PMC_PCER1_PID43_Pos)) /* Assignment of value for PID43 in the PMC_PCER1 register */
#define PMC_PCER1_PID44_Pos                   _UINT32_(12)                                         /* (PMC_PCER1) Peripheral Clock 44 Enable Position */
#define PMC_PCER1_PID44_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID44_Pos)               /* (PMC_PCER1) Peripheral Clock 44 Enable Mask */
#define PMC_PCER1_PID44(value)                (PMC_PCER1_PID44_Msk & (_UINT32_(value) << PMC_PCER1_PID44_Pos)) /* Assignment of value for PID44 in the PMC_PCER1 register */
#define PMC_PCER1_PID45_Pos                   _UINT32_(13)                                         /* (PMC_PCER1) Peripheral Clock 45 Enable Position */
#define PMC_PCER1_PID45_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID45_Pos)               /* (PMC_PCER1) Peripheral Clock 45 Enable Mask */
#define PMC_PCER1_PID45(value)                (PMC_PCER1_PID45_Msk & (_UINT32_(value) << PMC_PCER1_PID45_Pos)) /* Assignment of value for PID45 in the PMC_PCER1 register */
#define PMC_PCER1_PID46_Pos                   _UINT32_(14)                                         /* (PMC_PCER1) Peripheral Clock 46 Enable Position */
#define PMC_PCER1_PID46_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID46_Pos)               /* (PMC_PCER1) Peripheral Clock 46 Enable Mask */
#define PMC_PCER1_PID46(value)                (PMC_PCER1_PID46_Msk & (_UINT32_(value) << PMC_PCER1_PID46_Pos)) /* Assignment of value for PID46 in the PMC_PCER1 register */
#define PMC_PCER1_PID47_Pos                   _UINT32_(15)                                         /* (PMC_PCER1) Peripheral Clock 47 Enable Position */
#define PMC_PCER1_PID47_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID47_Pos)               /* (PMC_PCER1) Peripheral Clock 47 Enable Mask */
#define PMC_PCER1_PID47(value)                (PMC_PCER1_PID47_Msk & (_UINT32_(value) << PMC_PCER1_PID47_Pos)) /* Assignment of value for PID47 in the PMC_PCER1 register */
#define PMC_PCER1_PID48_Pos                   _UINT32_(16)                                         /* (PMC_PCER1) Peripheral Clock 48 Enable Position */
#define PMC_PCER1_PID48_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID48_Pos)               /* (PMC_PCER1) Peripheral Clock 48 Enable Mask */
#define PMC_PCER1_PID48(value)                (PMC_PCER1_PID48_Msk & (_UINT32_(value) << PMC_PCER1_PID48_Pos)) /* Assignment of value for PID48 in the PMC_PCER1 register */
#define PMC_PCER1_PID49_Pos                   _UINT32_(17)                                         /* (PMC_PCER1) Peripheral Clock 49 Enable Position */
#define PMC_PCER1_PID49_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID49_Pos)               /* (PMC_PCER1) Peripheral Clock 49 Enable Mask */
#define PMC_PCER1_PID49(value)                (PMC_PCER1_PID49_Msk & (_UINT32_(value) << PMC_PCER1_PID49_Pos)) /* Assignment of value for PID49 in the PMC_PCER1 register */
#define PMC_PCER1_PID50_Pos                   _UINT32_(18)                                         /* (PMC_PCER1) Peripheral Clock 50 Enable Position */
#define PMC_PCER1_PID50_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID50_Pos)               /* (PMC_PCER1) Peripheral Clock 50 Enable Mask */
#define PMC_PCER1_PID50(value)                (PMC_PCER1_PID50_Msk & (_UINT32_(value) << PMC_PCER1_PID50_Pos)) /* Assignment of value for PID50 in the PMC_PCER1 register */
#define PMC_PCER1_PID51_Pos                   _UINT32_(19)                                         /* (PMC_PCER1) Peripheral Clock 51 Enable Position */
#define PMC_PCER1_PID51_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID51_Pos)               /* (PMC_PCER1) Peripheral Clock 51 Enable Mask */
#define PMC_PCER1_PID51(value)                (PMC_PCER1_PID51_Msk & (_UINT32_(value) << PMC_PCER1_PID51_Pos)) /* Assignment of value for PID51 in the PMC_PCER1 register */
#define PMC_PCER1_PID52_Pos                   _UINT32_(20)                                         /* (PMC_PCER1) Peripheral Clock 52 Enable Position */
#define PMC_PCER1_PID52_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID52_Pos)               /* (PMC_PCER1) Peripheral Clock 52 Enable Mask */
#define PMC_PCER1_PID52(value)                (PMC_PCER1_PID52_Msk & (_UINT32_(value) << PMC_PCER1_PID52_Pos)) /* Assignment of value for PID52 in the PMC_PCER1 register */
#define PMC_PCER1_PID53_Pos                   _UINT32_(21)                                         /* (PMC_PCER1) Peripheral Clock 53 Enable Position */
#define PMC_PCER1_PID53_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID53_Pos)               /* (PMC_PCER1) Peripheral Clock 53 Enable Mask */
#define PMC_PCER1_PID53(value)                (PMC_PCER1_PID53_Msk & (_UINT32_(value) << PMC_PCER1_PID53_Pos)) /* Assignment of value for PID53 in the PMC_PCER1 register */
#define PMC_PCER1_PID56_Pos                   _UINT32_(24)                                         /* (PMC_PCER1) Peripheral Clock 56 Enable Position */
#define PMC_PCER1_PID56_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID56_Pos)               /* (PMC_PCER1) Peripheral Clock 56 Enable Mask */
#define PMC_PCER1_PID56(value)                (PMC_PCER1_PID56_Msk & (_UINT32_(value) << PMC_PCER1_PID56_Pos)) /* Assignment of value for PID56 in the PMC_PCER1 register */
#define PMC_PCER1_PID57_Pos                   _UINT32_(25)                                         /* (PMC_PCER1) Peripheral Clock 57 Enable Position */
#define PMC_PCER1_PID57_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID57_Pos)               /* (PMC_PCER1) Peripheral Clock 57 Enable Mask */
#define PMC_PCER1_PID57(value)                (PMC_PCER1_PID57_Msk & (_UINT32_(value) << PMC_PCER1_PID57_Pos)) /* Assignment of value for PID57 in the PMC_PCER1 register */
#define PMC_PCER1_PID58_Pos                   _UINT32_(26)                                         /* (PMC_PCER1) Peripheral Clock 58 Enable Position */
#define PMC_PCER1_PID58_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID58_Pos)               /* (PMC_PCER1) Peripheral Clock 58 Enable Mask */
#define PMC_PCER1_PID58(value)                (PMC_PCER1_PID58_Msk & (_UINT32_(value) << PMC_PCER1_PID58_Pos)) /* Assignment of value for PID58 in the PMC_PCER1 register */
#define PMC_PCER1_PID59_Pos                   _UINT32_(27)                                         /* (PMC_PCER1) Peripheral Clock 59 Enable Position */
#define PMC_PCER1_PID59_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID59_Pos)               /* (PMC_PCER1) Peripheral Clock 59 Enable Mask */
#define PMC_PCER1_PID59(value)                (PMC_PCER1_PID59_Msk & (_UINT32_(value) << PMC_PCER1_PID59_Pos)) /* Assignment of value for PID59 in the PMC_PCER1 register */
#define PMC_PCER1_PID60_Pos                   _UINT32_(28)                                         /* (PMC_PCER1) Peripheral Clock 60 Enable Position */
#define PMC_PCER1_PID60_Msk                   (_UINT32_(0x1) << PMC_PCER1_PID60_Pos)               /* (PMC_PCER1) Peripheral Clock 60 Enable Mask */
#define PMC_PCER1_PID60(value)                (PMC_PCER1_PID60_Msk & (_UINT32_(value) << PMC_PCER1_PID60_Pos)) /* Assignment of value for PID60 in the PMC_PCER1 register */
#define PMC_PCER1_Msk                         _UINT32_(0x1F3FFFAF)                                 /* (PMC_PCER1) Register Mask  */

#define PMC_PCER1_PID_Pos                     _UINT32_(0)                                          /* (PMC_PCER1 Position) Peripheral Clock 6x Enable */
#define PMC_PCER1_PID_Msk                     (_UINT32_(0x1FFFFFF) << PMC_PCER1_PID_Pos)           /* (PMC_PCER1 Mask) PID */
#define PMC_PCER1_PID(value)                  (PMC_PCER1_PID_Msk & (_UINT32_(value) << PMC_PCER1_PID_Pos)) 

