MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/pmc.h
#define PMC_PCDR1_PID_Pos                     _UINT32_(0)                                          /* (PMC_PCDR1 Position) Peripheral Clock 6x Disable */
#define PMC_PCDR1_PID_Msk                     (_UINT32_(0x1FFFFFF) << PMC_PCDR1_PID_Pos)           /* (PMC_PCDR1 Mask) PID */
#define PMC_PCDR1_PID(value)                  (PMC_PCDR1_PID_Msk & (_UINT32_(value) << PMC_PCDR1_PID_Pos)) 

/* -------- PMC_PCSR1 : (PMC Offset: 0x108) ( R/ 32) Peripheral Clock Status Register 1 -------- */
#define PMC_PCSR1_PID32_Pos                   _UINT32_(0)                                          /* (PMC_PCSR1) Peripheral Clock 32 Status Position */
#define PMC_PCSR1_PID32_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID32_Pos)               /* (PMC_PCSR1) Peripheral Clock 32 Status Mask */
#define PMC_PCSR1_PID32(value)                (PMC_PCSR1_PID32_Msk & (_UINT32_(value) << PMC_PCSR1_PID32_Pos)) /* Assignment of value for PID32 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID33_Pos                   _UINT32_(1)                                          /* (PMC_PCSR1) Peripheral Clock 33 Status Position */
#define PMC_PCSR1_PID33_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID33_Pos)               /* (PMC_PCSR1) Peripheral Clock 33 Status Mask */
#define PMC_PCSR1_PID33(value)                (PMC_PCSR1_PID33_Msk & (_UINT32_(value) << PMC_PCSR1_PID33_Pos)) /* Assignment of value for PID33 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID34_Pos                   _UINT32_(2)                                          /* (PMC_PCSR1) Peripheral Clock 34 Status Position */
#define PMC_PCSR1_PID34_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID34_Pos)               /* (PMC_PCSR1) Peripheral Clock 34 Status Mask */
#define PMC_PCSR1_PID34(value)                (PMC_PCSR1_PID34_Msk & (_UINT32_(value) << PMC_PCSR1_PID34_Pos)) /* Assignment of value for PID34 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID35_Pos                   _UINT32_(3)                                          /* (PMC_PCSR1) Peripheral Clock 35 Status Position */
#define PMC_PCSR1_PID35_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID35_Pos)               /* (PMC_PCSR1) Peripheral Clock 35 Status Mask */
#define PMC_PCSR1_PID35(value)                (PMC_PCSR1_PID35_Msk & (_UINT32_(value) << PMC_PCSR1_PID35_Pos)) /* Assignment of value for PID35 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID37_Pos                   _UINT32_(5)                                          /* (PMC_PCSR1) Peripheral Clock 37 Status Position */
#define PMC_PCSR1_PID37_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID37_Pos)               /* (PMC_PCSR1) Peripheral Clock 37 Status Mask */
#define PMC_PCSR1_PID37(value)                (PMC_PCSR1_PID37_Msk & (_UINT32_(value) << PMC_PCSR1_PID37_Pos)) /* Assignment of value for PID37 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID39_Pos                   _UINT32_(7)                                          /* (PMC_PCSR1) Peripheral Clock 39 Status Position */
#define PMC_PCSR1_PID39_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID39_Pos)               /* (PMC_PCSR1) Peripheral Clock 39 Status Mask */
#define PMC_PCSR1_PID39(value)                (PMC_PCSR1_PID39_Msk & (_UINT32_(value) << PMC_PCSR1_PID39_Pos)) /* Assignment of value for PID39 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID40_Pos                   _UINT32_(8)                                          /* (PMC_PCSR1) Peripheral Clock 40 Status Position */
#define PMC_PCSR1_PID40_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID40_Pos)               /* (PMC_PCSR1) Peripheral Clock 40 Status Mask */
#define PMC_PCSR1_PID40(value)                (PMC_PCSR1_PID40_Msk & (_UINT32_(value) << PMC_PCSR1_PID40_Pos)) /* Assignment of value for PID40 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID41_Pos                   _UINT32_(9)                                          /* (PMC_PCSR1) Peripheral Clock 41 Status Position */
#define PMC_PCSR1_PID41_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID41_Pos)               /* (PMC_PCSR1) Peripheral Clock 41 Status Mask */
#define PMC_PCSR1_PID41(value)                (PMC_PCSR1_PID41_Msk & (_UINT32_(value) << PMC_PCSR1_PID41_Pos)) /* Assignment of value for PID41 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID42_Pos                   _UINT32_(10)                                         /* (PMC_PCSR1) Peripheral Clock 42 Status Position */
#define PMC_PCSR1_PID42_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID42_Pos)               /* (PMC_PCSR1) Peripheral Clock 42 Status Mask */
#define PMC_PCSR1_PID42(value)                (PMC_PCSR1_PID42_Msk & (_UINT32_(value) << PMC_PCSR1_PID42_Pos)) /* Assignment of value for PID42 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID43_Pos                   _UINT32_(11)                                         /* (PMC_PCSR1) Peripheral Clock 43 Status Position */
#define PMC_PCSR1_PID43_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID43_Pos)               /* (PMC_PCSR1) Peripheral Clock 43 Status Mask */
#define PMC_PCSR1_PID43(value)                (PMC_PCSR1_PID43_Msk & (_UINT32_(value) << PMC_PCSR1_PID43_Pos)) /* Assignment of value for PID43 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID44_Pos                   _UINT32_(12)                                         /* (PMC_PCSR1) Peripheral Clock 44 Status Position */
#define PMC_PCSR1_PID44_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID44_Pos)               /* (PMC_PCSR1) Peripheral Clock 44 Status Mask */
#define PMC_PCSR1_PID44(value)                (PMC_PCSR1_PID44_Msk & (_UINT32_(value) << PMC_PCSR1_PID44_Pos)) /* Assignment of value for PID44 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID45_Pos                   _UINT32_(13)                                         /* (PMC_PCSR1) Peripheral Clock 45 Status Position */
#define PMC_PCSR1_PID45_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID45_Pos)               /* (PMC_PCSR1) Peripheral Clock 45 Status Mask */
#define PMC_PCSR1_PID45(value)                (PMC_PCSR1_PID45_Msk & (_UINT32_(value) << PMC_PCSR1_PID45_Pos)) /* Assignment of value for PID45 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID46_Pos                   _UINT32_(14)                                         /* (PMC_PCSR1) Peripheral Clock 46 Status Position */
#define PMC_PCSR1_PID46_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID46_Pos)               /* (PMC_PCSR1) Peripheral Clock 46 Status Mask */
#define PMC_PCSR1_PID46(value)                (PMC_PCSR1_PID46_Msk & (_UINT32_(value) << PMC_PCSR1_PID46_Pos)) /* Assignment of value for PID46 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID47_Pos                   _UINT32_(15)                                         /* (PMC_PCSR1) Peripheral Clock 47 Status Position */
#define PMC_PCSR1_PID47_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID47_Pos)               /* (PMC_PCSR1) Peripheral Clock 47 Status Mask */
#define PMC_PCSR1_PID47(value)                (PMC_PCSR1_PID47_Msk & (_UINT32_(value) << PMC_PCSR1_PID47_Pos)) /* Assignment of value for PID47 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID48_Pos                   _UINT32_(16)                                         /* (PMC_PCSR1) Peripheral Clock 48 Status Position */
#define PMC_PCSR1_PID48_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID48_Pos)               /* (PMC_PCSR1) Peripheral Clock 48 Status Mask */
#define PMC_PCSR1_PID48(value)                (PMC_PCSR1_PID48_Msk & (_UINT32_(value) << PMC_PCSR1_PID48_Pos)) /* Assignment of value for PID48 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID49_Pos                   _UINT32_(17)                                         /* (PMC_PCSR1) Peripheral Clock 49 Status Position */
#define PMC_PCSR1_PID49_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID49_Pos)               /* (PMC_PCSR1) Peripheral Clock 49 Status Mask */
#define PMC_PCSR1_PID49(value)                (PMC_PCSR1_PID49_Msk & (_UINT32_(value) << PMC_PCSR1_PID49_Pos)) /* Assignment of value for PID49 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID50_Pos                   _UINT32_(18)                                         /* (PMC_PCSR1) Peripheral Clock 50 Status Position */
#define PMC_PCSR1_PID50_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID50_Pos)               /* (PMC_PCSR1) Peripheral Clock 50 Status Mask */
#define PMC_PCSR1_PID50(value)                (PMC_PCSR1_PID50_Msk & (_UINT32_(value) << PMC_PCSR1_PID50_Pos)) /* Assignment of value for PID50 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID51_Pos                   _UINT32_(19)                                         /* (PMC_PCSR1) Peripheral Clock 51 Status Position */
#define PMC_PCSR1_PID51_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID51_Pos)               /* (PMC_PCSR1) Peripheral Clock 51 Status Mask */
#define PMC_PCSR1_PID51(value)                (PMC_PCSR1_PID51_Msk & (_UINT32_(value) << PMC_PCSR1_PID51_Pos)) /* Assignment of value for PID51 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID52_Pos                   _UINT32_(20)                                         /* (PMC_PCSR1) Peripheral Clock 52 Status Position */
#define PMC_PCSR1_PID52_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID52_Pos)               /* (PMC_PCSR1) Peripheral Clock 52 Status Mask */
#define PMC_PCSR1_PID52(value)                (PMC_PCSR1_PID52_Msk & (_UINT32_(value) << PMC_PCSR1_PID52_Pos)) /* Assignment of value for PID52 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID53_Pos                   _UINT32_(21)                                         /* (PMC_PCSR1) Peripheral Clock 53 Status Position */
#define PMC_PCSR1_PID53_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID53_Pos)               /* (PMC_PCSR1) Peripheral Clock 53 Status Mask */
#define PMC_PCSR1_PID53(value)                (PMC_PCSR1_PID53_Msk & (_UINT32_(value) << PMC_PCSR1_PID53_Pos)) /* Assignment of value for PID53 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID56_Pos                   _UINT32_(24)                                         /* (PMC_PCSR1) Peripheral Clock 56 Status Position */
#define PMC_PCSR1_PID56_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID56_Pos)               /* (PMC_PCSR1) Peripheral Clock 56 Status Mask */
#define PMC_PCSR1_PID56(value)                (PMC_PCSR1_PID56_Msk & (_UINT32_(value) << PMC_PCSR1_PID56_Pos)) /* Assignment of value for PID56 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID57_Pos                   _UINT32_(25)                                         /* (PMC_PCSR1) Peripheral Clock 57 Status Position */
#define PMC_PCSR1_PID57_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID57_Pos)               /* (PMC_PCSR1) Peripheral Clock 57 Status Mask */
#define PMC_PCSR1_PID57(value)                (PMC_PCSR1_PID57_Msk & (_UINT32_(value) << PMC_PCSR1_PID57_Pos)) /* Assignment of value for PID57 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID58_Pos                   _UINT32_(26)                                         /* (PMC_PCSR1) Peripheral Clock 58 Status Position */
#define PMC_PCSR1_PID58_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID58_Pos)               /* (PMC_PCSR1) Peripheral Clock 58 Status Mask */
#define PMC_PCSR1_PID58(value)                (PMC_PCSR1_PID58_Msk & (_UINT32_(value) << PMC_PCSR1_PID58_Pos)) /* Assignment of value for PID58 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID59_Pos                   _UINT32_(27)                                         /* (PMC_PCSR1) Peripheral Clock 59 Status Position */
#define PMC_PCSR1_PID59_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID59_Pos)               /* (PMC_PCSR1) Peripheral Clock 59 Status Mask */
#define PMC_PCSR1_PID59(value)                (PMC_PCSR1_PID59_Msk & (_UINT32_(value) << PMC_PCSR1_PID59_Pos)) /* Assignment of value for PID59 in the PMC_PCSR1 register */
#define PMC_PCSR1_PID60_Pos                   _UINT32_(28)                                         /* (PMC_PCSR1) Peripheral Clock 60 Status Position */
#define PMC_PCSR1_PID60_Msk                   (_UINT32_(0x1) << PMC_PCSR1_PID60_Pos)               /* (PMC_PCSR1) Peripheral Clock 60 Status Mask */
#define PMC_PCSR1_PID60(value)                (PMC_PCSR1_PID60_Msk & (_UINT32_(value) << PMC_PCSR1_PID60_Pos)) /* Assignment of value for PID60 in the PMC_PCSR1 register */
#define PMC_PCSR1_Msk                         _UINT32_(0x1F3FFFAF)                                 /* (PMC_PCSR1) Register Mask  */

#define PMC_PCSR1_PID_Pos                     _UINT32_(0)                                          /* (PMC_PCSR1 Position) Peripheral Clock 6x Status */
#define PMC_PCSR1_PID_Msk                     (_UINT32_(0x1FFFFFF) << PMC_PCSR1_PID_Pos)           /* (PMC_PCSR1 Mask) PID */
#define PMC_PCSR1_PID(value)                  (PMC_PCSR1_PID_Msk & (_UINT32_(value) << PMC_PCSR1_PID_Pos)) 

/* -------- PMC_PCR : (PMC Offset: 0x10C) (R/W 32) Peripheral Control Register -------- */
#define PMC_PCR_PID_Pos                       _UINT32_(0)                                          /* (PMC_PCR) Peripheral ID Position */
#define PMC_PCR_PID_Msk                       (_UINT32_(0x7F) << PMC_PCR_PID_Pos)                  /* (PMC_PCR) Peripheral ID Mask */
#define PMC_PCR_PID(value)                    (PMC_PCR_PID_Msk & (_UINT32_(value) << PMC_PCR_PID_Pos)) /* Assignment of value for PID in the PMC_PCR register */
#define PMC_PCR_GCLKCSS_Pos                   _UINT32_(8)                                          /* (PMC_PCR) Generic Clock Source Selection Position */
#define PMC_PCR_GCLKCSS_Msk                   (_UINT32_(0x7) << PMC_PCR_GCLKCSS_Pos)               /* (PMC_PCR) Generic Clock Source Selection Mask */
#define PMC_PCR_GCLKCSS(value)                (PMC_PCR_GCLKCSS_Msk & (_UINT32_(value) << PMC_PCR_GCLKCSS_Pos)) /* Assignment of value for GCLKCSS in the PMC_PCR register */
#define   PMC_PCR_GCLKCSS_SLOW_CLK_Val        _UINT32_(0x0)                                        /* (PMC_PCR) Slow clock is selected  */
#define   PMC_PCR_GCLKCSS_MAIN_CLK_Val        _UINT32_(0x1)                                        /* (PMC_PCR) Main clock is selected  */
#define   PMC_PCR_GCLKCSS_PLLA_CLK_Val        _UINT32_(0x2)                                        /* (PMC_PCR) PLLACK is selected  */
#define   PMC_PCR_GCLKCSS_UPLL_CLK_Val        _UINT32_(0x3)                                        /* (PMC_PCR) UPLL Clock is selected  */
#define   PMC_PCR_GCLKCSS_MCK_CLK_Val         _UINT32_(0x4)                                        /* (PMC_PCR) Master Clock is selected  */
#define PMC_PCR_GCLKCSS_SLOW_CLK              (PMC_PCR_GCLKCSS_SLOW_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) Slow clock is selected Position */
#define PMC_PCR_GCLKCSS_MAIN_CLK              (PMC_PCR_GCLKCSS_MAIN_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) Main clock is selected Position */
#define PMC_PCR_GCLKCSS_PLLA_CLK              (PMC_PCR_GCLKCSS_PLLA_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) PLLACK is selected Position */
#define PMC_PCR_GCLKCSS_UPLL_CLK              (PMC_PCR_GCLKCSS_UPLL_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) UPLL Clock is selected Position */
#define PMC_PCR_GCLKCSS_MCK_CLK               (PMC_PCR_GCLKCSS_MCK_CLK_Val << PMC_PCR_GCLKCSS_Pos) /* (PMC_PCR) Master Clock is selected Position */
#define PMC_PCR_CMD_Pos                       _UINT32_(12)                                         /* (PMC_PCR) Command Position */
#define PMC_PCR_CMD_Msk                       (_UINT32_(0x1) << PMC_PCR_CMD_Pos)                   /* (PMC_PCR) Command Mask */
#define PMC_PCR_CMD(value)                    (PMC_PCR_CMD_Msk & (_UINT32_(value) << PMC_PCR_CMD_Pos)) /* Assignment of value for CMD in the PMC_PCR register */
#define PMC_PCR_GCLKDIV_Pos                   _UINT32_(20)                                         /* (PMC_PCR) Generic Clock Division Ratio Position */
#define PMC_PCR_GCLKDIV_Msk                   (_UINT32_(0xFF) << PMC_PCR_GCLKDIV_Pos)              /* (PMC_PCR) Generic Clock Division Ratio Mask */
#define PMC_PCR_GCLKDIV(value)                (PMC_PCR_GCLKDIV_Msk & (_UINT32_(value) << PMC_PCR_GCLKDIV_Pos)) /* Assignment of value for GCLKDIV in the PMC_PCR register */
#define PMC_PCR_EN_Pos                        _UINT32_(28)                                         /* (PMC_PCR) Enable Position */
#define PMC_PCR_EN_Msk                        (_UINT32_(0x1) << PMC_PCR_EN_Pos)                    /* (PMC_PCR) Enable Mask */
#define PMC_PCR_EN(value)                     (PMC_PCR_EN_Msk & (_UINT32_(value) << PMC_PCR_EN_Pos)) /* Assignment of value for EN in the PMC_PCR register */
#define PMC_PCR_GCLKEN_Pos                    _UINT32_(29)                                         /* (PMC_PCR) Generic Clock Enable Position */
#define PMC_PCR_GCLKEN_Msk                    (_UINT32_(0x1) << PMC_PCR_GCLKEN_Pos)                /* (PMC_PCR) Generic Clock Enable Mask */
#define PMC_PCR_GCLKEN(value)                 (PMC_PCR_GCLKEN_Msk & (_UINT32_(value) << PMC_PCR_GCLKEN_Pos)) /* Assignment of value for GCLKEN in the PMC_PCR register */
#define PMC_PCR_Msk                           _UINT32_(0x3FF0177F)                                 /* (PMC_PCR) Register Mask  */


